In [1]:
import numpy as np 
import pandas as pd 
from pandas import Series,DataFrame

In [2]:
dframe = DataFrame({'city':['Alma','Brian head','fox park'], 'altitude':[2333443,56443434,1323432]})

In [3]:
dframe

         city  altitude
0        Alma   2333443
1  Brian head  56443434
2    fox park   1323432

In [4]:
state_map= {'Alma':'Colorado','Brian head':'Utah','fox park':'Wyoming'}

In [5]:
dframe['state']=dframe['city'].map(state_map)

In [6]:
dframe

         city  altitude     state
0        Alma   2333443  Colorado
1  Brian head  56443434      Utah
2    fox park   1323432   Wyoming